# IsSplit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..IsSplit Method
ViewSchedule Class See Also
---
Checks if the schedule is split.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public bool IsSplit()
```

Visual Basic
---
```text
Public Function IsSplit As Boolean
```

Visual C++
---
```text
public:
bool IsSplit()
```

# ### Return Value
True if the schedule is split. Otherwise false.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace